{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["args_0", "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/convolution/ReadVariableOp", "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/Relu", "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Shape", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack_1", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Shape", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack_1", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/1", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/2", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Squeeze"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Shape", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack_1", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes", "op": "Pack", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/1", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/2", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/ReadVariableOp", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose", "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/conv_transpose/ReadVariableOp", "shape": [3, 3, 16, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/input_sizes/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/conv_transpose/ReadVariableOp", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "shape": [3, 3, 16, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1/conv2d_1_2/Squeeze", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1/Squeeze", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_1_2/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/denoise_1/sequential_1_2/conv2d_transpose_2_1/Reshape", "shape": [1, 1, 1, 1], "dtype": "float32"}]}]}